pmo-dataset/variations/graphviz_basic/36.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Get airplane request" -> "Check desired airplane type";
  "Check desired airplane type" -> "Individual customizing?";
  "ParallelGateway_1" -> "Display bar type";
  "ParallelGateway_1" -> "Select number of seats";
  "ParallelGateway_1" -> "Select seat color";
  "ParallelGateway_1" -> "Introduce amount of water in the toilets";
  "Display bar type" -> "Bar type";
  "Select number of seats" -> "ParallelGateway_2";
  "Select seat color" -> "ParallelGateway_2";
  "Introduce amount of water in the toilets" -> "ParallelGateway_2";
  "Send customizing options" -> "Receive customizing requirements";
  "Receive customizing requirements" -> "ParallelGateway_1";
  "Send requirements to the russian team" -> "ExclusiveGateway";
  "Send requirements to the irish team" -> "ExclusiveGateway";
  "ExclusiveGateway" -> "Receive bar components";
  "Receive bar components" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Assemble interior";
  "Sent plane to customer" -> "Receive customer confirmation";
  "Receive customer confirmation" -> "EndEvent";
  "Test succesful" -> "Ajdust errors" [label="No"];
  "ParallelGateway_3" -> "Flight test";
  "Flight test" -> "Test succesful";
  "ParallelGateway_3" -> "Update flight protocol";
  "Update flight protocol" -> "Send protocol to customer";
  "Send protocol to customer" -> "ParallelGateway_4";
  "Test succesful" -> "ParallelGateway_4" [label="Yes"];
  "ParallelGateway_4" -> "Sent plane to customer";
  "Send requirements to french team" -> "ExclusiveGateway";
  "Send requirements to the american team" -> "ExclusiveGateway";
  "Send requirements to the italian team" -> "ExclusiveGateway";
  "Assemble interior" -> "ParallelGateway_3";
  "Ajdust errors" -> "Flight test";
  "Individual customizing?" -> "Send customizing options" [label="Yes"];
  "Individual customizing?" -> "Assemble interior" [label="No"];
  "Bar type" -> "Send requirements to the russian team" [label="Vodka bar"];
  "Bar type" -> "Send requirements to the irish team" [label="Whiskey bar"];
  "Bar type" -> "Send requirements to french team" [label="Wine bar"];
  "Bar type" -> "Send requirements to the american team" [label="Cocktail bar"];
  "Bar type" -> "Send requirements to the italian team" [label="Aperol bar"];

  "Get airplane request" [shape=circle, label="Get airplane request"];
  "EndEvent" [shape=circle, label=""];
  "Individual customizing?" [shape=diamond];
  "Bar type" [shape=diamond];
  "ExclusiveGateway" [shape=diamond, label="X"];
  "Test succesful" [shape=diamond];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];
  "ParallelGateway_3" [shape=diamond, label="+"];
  "ParallelGateway_4" [shape=diamond, label="+"];
}
